Autodesk.Revit.DB.Structure.StructuralConnectionHandler.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId,System.String)
Creates a new instance of a Structural Connection Handler, which defines the connection between given elements.
Remarks:
Elements should be of the following structural categories: framings (OST_StructuralFraming), columns (OST_StructuralColumns), walls (OST_Walls), floors (OST_Floors) or foundations (OST_StructuralFoundations).
The first of given elements is set as primary one.
This constructor skips informing the addin about type change. SteelElement creation is done before the constructor call
document:
The Revit document.
idsToConnect:
List of element ids of connected elements.
typeId:
The type of Structural Connection Handler.
extEntId:
The id of the asociated ext entity
Returns:
The newly created connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It verifies that we have at least one element id in the list.
-or-
The type typeId is not a valid StructuralConnectionHandlerType.
-or-
Missing detailed structural connection service implementation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.CreateGenericConnection(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Creates a new instance of a Structural Connection Handler with a generic type, which defines the connection between given elements.
Remarks:
Elements should be of the following structural categories: framings (OST_StructuralFraming), columns (OST_StructuralColumns), walls (OST_Walls), floors (OST_Floors) or foundations (OST_StructuralFoundations).
The first of given elements is set as the primary one.
A generic connection type will be created by default, if there is none present in the model.
document:
The Revit document.
idsToConnect:
The list of element ids of connected elements.
Returns:
The newly created generic connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It verifies that we have at least one element id in the list.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2021

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.ConnectionInputPoint})
Creates a new instance of a Structural Connection Handler, which is defined by the elements to connect and the additional points.
Remarks:
Elements should be of the following structural categories: framings (OST_StructuralFraming), columns (OST_StructuralColumns), walls (OST_Walls), floors (OST_Floors) or foundations (OST_StructuralFoundations).
The first of given elements is set as primary one.
The placement of the connection takes into account the additional definition points.
document:
The Revit document.
idsToConnect:
List of element ids of connected elements.
typeId:
The type of Structural Connection Handler.
additionalInputPoints:
The array of points that help define the connection.
Returns:
The newly created connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It verifies that we have at least one element id in the list.
-or-
The type typeId is not a valid StructuralConnectionHandlerType.
-or-
Missing detailed structural connection service implementation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2021

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Creates a new instance of a Structural Connection Handler, which defines the connection between given elements.
Remarks:
Elements should be of the following structural categories: framings (OST_StructuralFraming), columns (OST_StructuralColumns), walls (OST_Walls), floors (OST_Floors) or foundations (OST_StructuralFoundations).
The first of given elements is set as primary one.
document:
The Revit document.
idsToConnect:
List of element ids of connected elements.
typeId:
The type of Structural Connection Handler.
Returns:
The newly created connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It verifies that we have at least one element id in the list.
-or-
The type typeId is not a valid StructuralConnectionHandlerType.
-or-
Missing detailed structural connection service implementation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Creates a new instance of a Structural Connection Handler, which defines the connection between given elements.
Remarks:
Elements should be of the following structural categories: framings (OST_StructuralFraming), columns (OST_StructuralColumns), walls (OST_Walls), floors (OST_Floors) or foundations (OST_StructuralFoundations).
The first of given elements is set as the primary one.
document:
The Revit document.
idsToConnect:
List of element ids of connected elements.
Returns:
The newly created connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It verifies that we have at least one element id in the list.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017